In [49]:
import pandas as pd

data = pd.read_excel("Employee_data.xlsx")
print(data)

   Employee ID First Name Last Name        Department     Position  \
0      EMP0001       Emma  Anderson        Operations    Assistant
1      EMP0002     Olivia    Thomas        Operations      Manager
2      EMP0003       Noah     Brown             Sales  Coordinator
3      EMP0004      Ethan    Martin                IT  Coordinator
4      EMP0005       Liam     Brown  Customer Service  Coordinator
5      EMP0006       Emma  Anderson             Sales      Manager
6      EMP0007     Olivia     Brown             Sales   Specialist
7      EMP0008       John    Harris                HR      Analyst
8      EMP0009      Ethan     Brown        Operations    Assistant
9      EMP0010    Michael     Smith             Sales   Specialist
10     EMP0011        Ava   Jackson         Marketing      Analyst
11     EMP0012       Emma    Harris  Customer Service    Assistant
12     EMP0013       Liam    Taylor        Operations   Specialist
13     EMP0014       Noah  Anderson           Finance      Analyst
14     EMP0015    Michael     Smith             Sales      Manager
15     EMP0016       Emma     Smith             Sales      Analyst
16     EMP0017      Ethan   Johnson                HR    Executive
17     EMP0018   Isabella    Taylor           Finance      Analyst
18     EMP0019        Ava    Taylor             Sales    Executive
19     EMP0020   Isabella     Smith                HR      Manager
20     EMP0021        Ava    Thomas        Operations   Specialist
21     EMP0022   Isabella    Harris         Marketing      Manager
22     EMP0023       Emma     Brown                IT    Assistant
23     EMP0024       Liam     White  Customer Service      Analyst
24     EMP0025   Isabella    Taylor             Sales    Assistant
25     EMP0026       John    Thomas                IT   Specialist
26     EMP0027     Olivia  Anderson                IT   Specialist
27     EMP0028       Liam     Smith                IT  Coordinator
28     EMP0029       John    Harris         Marketing    Executive
29     EMP0030       John     Smith             Sales      Manager
30     EMP0031       Noah    Harris  Customer Service    Executive
31     EMP0032        Ava    Taylor  Customer Service      Manager
32     EMP0033       Liam     Smith                HR    Executive
33     EMP0034    Michael    Martin  Customer Service  Coordinator
34     EMP0035   Isabella  Anderson             Sales      Analyst
35     EMP0036    Michael     Brown        Operations  Coordinator
36     EMP0037    Michael    Martin                IT      Analyst
37     EMP0038    Michael    Taylor         Marketing  Coordinator
38     EMP0039       Emma     Brown             Sales    Executive
39     EMP0040     Olivia     Brown             Sales    Assistant
40     EMP0041       John  Anderson         Marketing    Assistant
41     EMP0042        Ava     White                IT   Specialist
42     EMP0043     Olivia     White                IT  Coordinator
43     EMP0044    Michael    Taylor                IT  Coordinator
44     EMP0045    Michael    Taylor                HR      Analyst
45     EMP0046       John  Anderson  Customer Service    Assistant
46     EMP0047     Olivia    Harris         Marketing    Assistant
47     EMP0048       Liam    Martin           Finance    Executive
48     EMP0049      Ethan   Johnson                IT      Manager
49     EMP0050       Emma     Brown  Customer Service      Analyst

            City  Salary (USD)
0       New York         91974
1      San Diego         64931
2    San Antonio         85945
3    Los Angeles         65273
4   Philadelphia         87009
5    Los Angeles         47057
6    Los Angeles        100193
7       New York         45613
8    Los Angeles         93016
9       New York         68990
10     San Diego        105629
11     San Diego        102214
12   Los Angeles         77615
13       Houston         67584
14       Phoenix        100459
15   Los Angeles         50933
16  Philadelphia        101308
17  Philadelphia        119218
18       Houston        107842
19       Chicago         55892
20       Houston         60556
21   San Antonio         54189
22       Houston         65278
23     San Diego         44944
24  Philadelphia         77901
25  Philadelphia        118877
26  Philadelphia         58424
27  Philadelphia         78695
28       Houston        113310
29   San Antonio         63155
30       Houston         54490
31      New York         89299
32       Chicago         78460
33       Chicago         58082
34       Chicago        114480
35      New York         93610
36   Los Angeles         46803
37   Los Angeles        100719
38       Houston         77634
39       Chicago         55036
40     San Diego         41846
41  Philadelphia         86396
42  Philadelphia        101156
43  Philadelphia         80431
44       Houston         87162
45   Los Angeles         62168
46   San Antonio         52192
47   Los Angeles         91608
48   San Antonio         58347
49   Los Angeles         95970

In [50]:
data ["Full Name"] = data["First Name"] + " " + data["Last Name"] 
print(data)

   Employee ID First Name Last Name        Department     Position  \
0      EMP0001       Emma  Anderson        Operations    Assistant
1      EMP0002     Olivia    Thomas        Operations      Manager
2      EMP0003       Noah     Brown             Sales  Coordinator
3      EMP0004      Ethan    Martin                IT  Coordinator
4      EMP0005       Liam     Brown  Customer Service  Coordinator
5      EMP0006       Emma  Anderson             Sales      Manager
6      EMP0007     Olivia     Brown             Sales   Specialist
7      EMP0008       John    Harris                HR      Analyst
8      EMP0009      Ethan     Brown        Operations    Assistant
9      EMP0010    Michael     Smith             Sales   Specialist
10     EMP0011        Ava   Jackson         Marketing      Analyst
11     EMP0012       Emma    Harris  Customer Service    Assistant
12     EMP0013       Liam    Taylor        Operations   Specialist
13     EMP0014       Noah  Anderson           Finance      Analyst
14     EMP0015    Michael     Smith             Sales      Manager
15     EMP0016       Emma     Smith             Sales      Analyst
16     EMP0017      Ethan   Johnson                HR    Executive
17     EMP0018   Isabella    Taylor           Finance      Analyst
18     EMP0019        Ava    Taylor             Sales    Executive
19     EMP0020   Isabella     Smith                HR      Manager
20     EMP0021        Ava    Thomas        Operations   Specialist
21     EMP0022   Isabella    Harris         Marketing      Manager
22     EMP0023       Emma     Brown                IT    Assistant
23     EMP0024       Liam     White  Customer Service      Analyst
24     EMP0025   Isabella    Taylor             Sales    Assistant
25     EMP0026       John    Thomas                IT   Specialist
26     EMP0027     Olivia  Anderson                IT   Specialist
27     EMP0028       Liam     Smith                IT  Coordinator
28     EMP0029       John    Harris         Marketing    Executive
29     EMP0030       John     Smith             Sales      Manager
30     EMP0031       Noah    Harris  Customer Service    Executive
31     EMP0032        Ava    Taylor  Customer Service      Manager
32     EMP0033       Liam     Smith                HR    Executive
33     EMP0034    Michael    Martin  Customer Service  Coordinator
34     EMP0035   Isabella  Anderson             Sales      Analyst
35     EMP0036    Michael     Brown        Operations  Coordinator
36     EMP0037    Michael    Martin                IT      Analyst
37     EMP0038    Michael    Taylor         Marketing  Coordinator
38     EMP0039       Emma     Brown             Sales    Executive
39     EMP0040     Olivia     Brown             Sales    Assistant
40     EMP0041       John  Anderson         Marketing    Assistant
41     EMP0042        Ava     White                IT   Specialist
42     EMP0043     Olivia     White                IT  Coordinator
43     EMP0044    Michael    Taylor                IT  Coordinator
44     EMP0045    Michael    Taylor                HR      Analyst
45     EMP0046       John  Anderson  Customer Service    Assistant
46     EMP0047     Olivia    Harris         Marketing    Assistant
47     EMP0048       Liam    Martin           Finance    Executive
48     EMP0049      Ethan   Johnson                IT      Manager
49     EMP0050       Emma     Brown  Customer Service      Analyst

            City  Salary (USD)          Full Name
0       New York         91974      Emma Anderson
1      San Diego         64931      Olivia Thomas
2    San Antonio         85945         Noah Brown
3    Los Angeles         65273       Ethan Martin
4   Philadelphia         87009         Liam Brown
5    Los Angeles         47057      Emma Anderson
6    Los Angeles        100193       Olivia Brown
7       New York         45613        John Harris
8    Los Angeles         93016        Ethan Brown
9       New York         68990      Michael Smith
10     San Diego        105629        Ava Jackson
11     San Diego        102214        Emma Harris
12   Los Angeles         77615        Liam Taylor
13       Houston         67584      Noah Anderson
14       Phoenix        100459      Michael Smith
15   Los Angeles         50933         Emma Smith
16  Philadelphia        101308      Ethan Johnson
17  Philadelphia        119218    Isabella Taylor
18       Houston        107842         Ava Taylor
19       Chicago         55892     Isabella Smith
20       Houston         60556         Ava Thomas
21   San Antonio         54189    Isabella Harris
22       Houston         65278         Emma Brown
23     San Diego         44944         Liam White
24  Philadelphia         77901    Isabella Taylor
25  Philadelphia        118877        John Thomas
26  Philadelphia         58424    Olivia Anderson
27  Philadelphia         78695         Liam Smith
28       Houston        113310        John Harris
29   San Antonio         63155         John Smith
30       Houston         54490        Noah Harris
31      New York         89299         Ava Taylor
32       Chicago         78460         Liam Smith
33       Chicago         58082     Michael Martin
34       Chicago        114480  Isabella Anderson
35      New York         93610      Michael Brown
36   Los Angeles         46803     Michael Martin
37   Los Angeles        100719     Michael Taylor
38       Houston         77634         Emma Brown
39       Chicago         55036       Olivia Brown
40     San Diego         41846      John Anderson
41  Philadelphia         86396          Ava White
42  Philadelphia        101156       Olivia White
43  Philadelphia         80431     Michael Taylor
44       Houston         87162     Michael Taylor
45   Los Angeles         62168      John Anderson
46   San Antonio         52192      Olivia Harris
47   Los Angeles         91608        Liam Martin
48   San Antonio         58347      Ethan Johnson
49   Los Angeles         95970         Emma Brown

In [3]:
data["Bonus"] = (data["Salary (USD)"] / 100 ) * 20
print(data)

   Employee ID First Name Last Name        Department     Position  \
0      EMP0001       Emma  Anderson        Operations    Assistant
1      EMP0002     Olivia    Thomas        Operations      Manager
2      EMP0003       Noah     Brown             Sales  Coordinator
3      EMP0004      Ethan    Martin                IT  Coordinator
4      EMP0005       Liam     Brown  Customer Service  Coordinator
5      EMP0006       Emma  Anderson             Sales      Manager
6      EMP0007     Olivia     Brown             Sales   Specialist
7      EMP0008       John    Harris                HR      Analyst
8      EMP0009      Ethan     Brown        Operations    Assistant
9      EMP0010    Michael     Smith             Sales   Specialist
10     EMP0011        Ava   Jackson         Marketing      Analyst
11     EMP0012       Emma    Harris  Customer Service    Assistant
12     EMP0013       Liam    Taylor        Operations   Specialist
13     EMP0014       Noah  Anderson           Finance      Analyst
14     EMP0015    Michael     Smith             Sales      Manager
15     EMP0016       Emma     Smith             Sales      Analyst
16     EMP0017      Ethan   Johnson                HR    Executive
17     EMP0018   Isabella    Taylor           Finance      Analyst
18     EMP0019        Ava    Taylor             Sales    Executive
19     EMP0020   Isabella     Smith                HR      Manager
20     EMP0021        Ava    Thomas        Operations   Specialist
21     EMP0022   Isabella    Harris         Marketing      Manager
22     EMP0023       Emma     Brown                IT    Assistant
23     EMP0024       Liam     White  Customer Service      Analyst
24     EMP0025   Isabella    Taylor             Sales    Assistant
25     EMP0026       John    Thomas                IT   Specialist
26     EMP0027     Olivia  Anderson                IT   Specialist
27     EMP0028       Liam     Smith                IT  Coordinator
28     EMP0029       John    Harris         Marketing    Executive
29     EMP0030       John     Smith             Sales      Manager
30     EMP0031       Noah    Harris  Customer Service    Executive
31     EMP0032        Ava    Taylor  Customer Service      Manager
32     EMP0033       Liam     Smith                HR    Executive
33     EMP0034    Michael    Martin  Customer Service  Coordinator
34     EMP0035   Isabella  Anderson             Sales      Analyst
35     EMP0036    Michael     Brown        Operations  Coordinator
36     EMP0037    Michael    Martin                IT      Analyst
37     EMP0038    Michael    Taylor         Marketing  Coordinator
38     EMP0039       Emma     Brown             Sales    Executive
39     EMP0040     Olivia     Brown             Sales    Assistant
40     EMP0041       John  Anderson         Marketing    Assistant
41     EMP0042        Ava     White                IT   Specialist
42     EMP0043     Olivia     White                IT  Coordinator
43     EMP0044    Michael    Taylor                IT  Coordinator
44     EMP0045    Michael    Taylor                HR      Analyst
45     EMP0046       John  Anderson  Customer Service    Assistant
46     EMP0047     Olivia    Harris         Marketing    Assistant
47     EMP0048       Liam    Martin           Finance    Executive
48     EMP0049      Ethan   Johnson                IT      Manager
49     EMP0050       Emma     Brown  Customer Service      Analyst

            City  Salary (USD)          Full Name    Bonus
0       New York         91974      Emma Anderson  18394.8
1      San Diego         64931      Olivia Thomas  12986.2
2    San Antonio         85945         Noah Brown  17189.0
3    Los Angeles         65273       Ethan Martin  13054.6
4   Philadelphia         87009         Liam Brown  17401.8
5    Los Angeles         47057      Emma Anderson   9411.4
6    Los Angeles        100193       Olivia Brown  20038.6
7       New York         45613        John Harris   9122.6
8    Los Angeles         93016        Ethan Brown  18603.2
9       New York         68990      Michael Smith  13798.0
10     San Diego        105629        Ava Jackson  21125.8
11     San Diego        102214        Emma Harris  20442.8
12   Los Angeles         77615        Liam Taylor  15523.0
13       Houston         67584      Noah Anderson  13516.8
14       Phoenix        100459      Michael Smith  20091.8
15   Los Angeles         50933         Emma Smith  10186.6
16  Philadelphia        101308      Ethan Johnson  20261.6
17  Philadelphia        119218    Isabella Taylor  23843.6
18       Houston        107842         Ava Taylor  21568.4
19       Chicago         55892     Isabella Smith  11178.4
20       Houston         60556         Ava Thomas  12111.2
21   San Antonio         54189    Isabella Harris  10837.8
22       Houston         65278         Emma Brown  13055.6
23     San Diego         44944         Liam White   8988.8
24  Philadelphia         77901    Isabella Taylor  15580.2
25  Philadelphia        118877        John Thomas  23775.4
26  Philadelphia         58424    Olivia Anderson  11684.8
27  Philadelphia         78695         Liam Smith  15739.0
28       Houston        113310        John Harris  22662.0
29   San Antonio         63155         John Smith  12631.0
30       Houston         54490        Noah Harris  10898.0
31      New York         89299         Ava Taylor  17859.8
32       Chicago         78460         Liam Smith  15692.0
33       Chicago         58082     Michael Martin  11616.4
34       Chicago        114480  Isabella Anderson  22896.0
35      New York         93610      Michael Brown  18722.0
36   Los Angeles         46803     Michael Martin   9360.6
37   Los Angeles        100719     Michael Taylor  20143.8
38       Houston         77634         Emma Brown  15526.8
39       Chicago         55036       Olivia Brown  11007.2
40     San Diego         41846      John Anderson   8369.2
41  Philadelphia         86396          Ava White  17279.2
42  Philadelphia        101156       Olivia White  20231.2
43  Philadelphia         80431     Michael Taylor  16086.2
44       Houston         87162     Michael Taylor  17432.4
45   Los Angeles         62168      John Anderson  12433.6
46   San Antonio         52192      Olivia Harris  10438.4
47   Los Angeles         91608        Liam Martin  18321.6
48   San Antonio         58347      Ethan Johnson  11669.4
49   Los Angeles         95970         Emma Brown  19194.0

In [51]:
def extract(value) :
    return value[0:6]

data["emp_city"] = data["City"].map(extract)
print(data)

   Employee ID First Name Last Name        Department     Position  \
0      EMP0001       Emma  Anderson        Operations    Assistant
1      EMP0002     Olivia    Thomas        Operations      Manager
2      EMP0003       Noah     Brown             Sales  Coordinator
3      EMP0004      Ethan    Martin                IT  Coordinator
4      EMP0005       Liam     Brown  Customer Service  Coordinator
5      EMP0006       Emma  Anderson             Sales      Manager
6      EMP0007     Olivia     Brown             Sales   Specialist
7      EMP0008       John    Harris                HR      Analyst
8      EMP0009      Ethan     Brown        Operations    Assistant
9      EMP0010    Michael     Smith             Sales   Specialist
10     EMP0011        Ava   Jackson         Marketing      Analyst
11     EMP0012       Emma    Harris  Customer Service    Assistant
12     EMP0013       Liam    Taylor        Operations   Specialist
13     EMP0014       Noah  Anderson           Finance      Analyst
14     EMP0015    Michael     Smith             Sales      Manager
15     EMP0016       Emma     Smith             Sales      Analyst
16     EMP0017      Ethan   Johnson                HR    Executive
17     EMP0018   Isabella    Taylor           Finance      Analyst
18     EMP0019        Ava    Taylor             Sales    Executive
19     EMP0020   Isabella     Smith                HR      Manager
20     EMP0021        Ava    Thomas        Operations   Specialist
21     EMP0022   Isabella    Harris         Marketing      Manager
22     EMP0023       Emma     Brown                IT    Assistant
23     EMP0024       Liam     White  Customer Service      Analyst
24     EMP0025   Isabella    Taylor             Sales    Assistant
25     EMP0026       John    Thomas                IT   Specialist
26     EMP0027     Olivia  Anderson                IT   Specialist
27     EMP0028       Liam     Smith                IT  Coordinator
28     EMP0029       John    Harris         Marketing    Executive
29     EMP0030       John     Smith             Sales      Manager
30     EMP0031       Noah    Harris  Customer Service    Executive
31     EMP0032        Ava    Taylor  Customer Service      Manager
32     EMP0033       Liam     Smith                HR    Executive
33     EMP0034    Michael    Martin  Customer Service  Coordinator
34     EMP0035   Isabella  Anderson             Sales      Analyst
35     EMP0036    Michael     Brown        Operations  Coordinator
36     EMP0037    Michael    Martin                IT      Analyst
37     EMP0038    Michael    Taylor         Marketing  Coordinator
38     EMP0039       Emma     Brown             Sales    Executive
39     EMP0040     Olivia     Brown             Sales    Assistant
40     EMP0041       John  Anderson         Marketing    Assistant
41     EMP0042        Ava     White                IT   Specialist
42     EMP0043     Olivia     White                IT  Coordinator
43     EMP0044    Michael    Taylor                IT  Coordinator
44     EMP0045    Michael    Taylor                HR      Analyst
45     EMP0046       John  Anderson  Customer Service    Assistant
46     EMP0047     Olivia    Harris         Marketing    Assistant
47     EMP0048       Liam    Martin           Finance    Executive
48     EMP0049      Ethan   Johnson                IT      Manager
49     EMP0050       Emma     Brown  Customer Service      Analyst

            City  Salary (USD)          Full Name emp_city
0       New York         91974      Emma Anderson   New Yo
1      San Diego         64931      Olivia Thomas   San Di
2    San Antonio         85945         Noah Brown   San An
3    Los Angeles         65273       Ethan Martin   Los An
4   Philadelphia         87009         Liam Brown   Philad
5    Los Angeles         47057      Emma Anderson   Los An
6    Los Angeles        100193       Olivia Brown   Los An
7       New York         45613        John Harris   New Yo
8    Los Angeles         93016        Ethan Brown   Los An
9       New York         68990      Michael Smith   New Yo
10     San Diego        105629        Ava Jackson   San Di
11     San Diego        102214        Emma Harris   San Di
12   Los Angeles         77615        Liam Taylor   Los An
13       Houston         67584      Noah Anderson   Housto
14       Phoenix        100459      Michael Smith   Phoeni
15   Los Angeles         50933         Emma Smith   Los An
16  Philadelphia        101308      Ethan Johnson   Philad
17  Philadelphia        119218    Isabella Taylor   Philad
18       Houston        107842         Ava Taylor   Housto
19       Chicago         55892     Isabella Smith   Chicag
20       Houston         60556         Ava Thomas   Housto
21   San Antonio         54189    Isabella Harris   San An
22       Houston         65278         Emma Brown   Housto
23     San Diego         44944         Liam White   San Di
24  Philadelphia         77901    Isabella Taylor   Philad
25  Philadelphia        118877        John Thomas   Philad
26  Philadelphia         58424    Olivia Anderson   Philad
27  Philadelphia         78695         Liam Smith   Philad
28       Houston        113310        John Harris   Housto
29   San Antonio         63155         John Smith   San An
30       Houston         54490        Noah Harris   Housto
31      New York         89299         Ava Taylor   New Yo
32       Chicago         78460         Liam Smith   Chicag
33       Chicago         58082     Michael Martin   Chicag
34       Chicago        114480  Isabella Anderson   Chicag
35      New York         93610      Michael Brown   New Yo
36   Los Angeles         46803     Michael Martin   Los An
37   Los Angeles        100719     Michael Taylor   Los An
38       Houston         77634         Emma Brown   Housto
39       Chicago         55036       Olivia Brown   Chicag
40     San Diego         41846      John Anderson   San Di
41  Philadelphia         86396          Ava White   Philad
42  Philadelphia        101156       Olivia White   Philad
43  Philadelphia         80431     Michael Taylor   Philad
44       Houston         87162     Michael Taylor   Housto
45   Los Angeles         62168      John Anderson   Los An
46   San Antonio         52192      Olivia Harris   San An
47   Los Angeles         91608        Liam Martin   Los An
48   San Antonio         58347      Ethan Johnson   San An
49   Los Angeles         95970         Emma Brown   Los An

In [ ]:
# GROUP BY IN PANDAS

In [11]:
gb = data.groupby("Position").agg({"Employee ID":"count"})
print(gb)

             Employee ID
Position
Analyst               10
Assistant              9
Coordinator            9
Executive              7
Manager                8
Specialist             7

In [15]:
gb = data.groupby(["Department","Position"]).agg({"Employee ID":"count"})
print(gb)

                              Employee ID
Department       Position
Customer Service Analyst                2
                 Assistant              2
                 Coordinator            2
                 Executive              1
                 Manager                1
Finance          Analyst                2
                 Executive              1
HR               Analyst                2
                 Executive              2
                 Manager                1
IT               Analyst                1
                 Assistant              1
                 Coordinator            4
                 Manager                1
                 Specialist             3
Marketing        Analyst                1
                 Assistant              2
                 Coordinator            1
                 Executive              1
                 Manager                1
Operations       Assistant              2
                 Coordinator            1
                 Manager                1
                 Specialist             2
Sales            Analyst                2
                 Assistant              2
                 Coordinator            1
                 Executive              2
                 Manager                3
                 Specialist             2

In [52]:
gb = data.groupby(["Position","Department"]).agg({"Employee ID":"count"})
print(gb)

                              Employee ID
Position    Department
Analyst     Customer Service            2
            Finance                     2
            HR                          2
            IT                          1
            Marketing                   1
            Sales                       2
Assistant   Customer Service            2
            IT                          1
            Marketing                   2
            Operations                  2
            Sales                       2
Coordinator Customer Service            2
            IT                          4
            Marketing                   1
            Operations                  1
            Sales                       1
Executive   Customer Service            1
            Finance                     1
            HR                          2
            Marketing                   1
            Sales                       2
Manager     Customer Service            1
            HR                          1
            IT                          1
            Marketing                   1
            Operations                  1
            Sales                       3
Specialist  IT                          3
            Operations                  2
            Sales                       2

In [17]:
mean_salary = data.groupby("City").agg({"Salary (USD)":"mean"})
print(mean_salary)

               Salary (USD)
City
Chicago        72390.000000
Houston        79232.000000
Los Angeles    75577.727273
New York       77897.200000
Philadelphia   90941.500000
Phoenix       100459.000000
San Antonio    62765.600000
San Diego      71912.800000

In [19]:
max_salary = data.groupby("City").agg({"Salary (USD)":"max"})
print(max_salary)

              Salary (USD)
City
Chicago             114480
Houston             113310
Los Angeles         100719
New York             93610
Philadelphia        119218
Phoenix             100459
San Antonio          85945
San Diego           105629

In [20]:
min_salary = data.groupby("City").agg({"Salary (USD)":"min"})
print(min_salary)

              Salary (USD)
City
Chicago              55036
Houston              54490
Los Angeles          46803
New York             45613
Philadelphia         58424
Phoenix             100459
San Antonio          52192
San Diego            41846

In [22]:
max_salary = data.groupby(["City","Department","Position"]).agg({"Salary (USD)":"max"})
print(max_salary)

                                           Salary (USD)
City         Department       Position
Chicago      Customer Service Coordinator         58082
             HR               Executive           78460
                              Manager             55892
             Sales            Analyst            114480
                              Assistant           55036
Houston      Customer Service Executive           54490
             Finance          Analyst             67584
             HR               Analyst             87162
             IT               Assistant           65278
             Marketing        Executive          113310
             Operations       Specialist          60556
             Sales            Executive          107842
Los Angeles  Customer Service Analyst             95970
                              Assistant           62168
             Finance          Executive           91608
             IT               Analyst             46803
                              Coordinator         65273
             Marketing        Coordinator        100719
             Operations       Assistant           93016
                              Specialist          77615
             Sales            Analyst             50933
                              Manager             47057
                              Specialist         100193
New York     Customer Service Manager             89299
             HR               Analyst             45613
             Operations       Assistant           91974
                              Coordinator         93610
             Sales            Specialist          68990
Philadelphia Customer Service Coordinator         87009
             Finance          Analyst            119218
             HR               Executive          101308
             IT               Coordinator        101156
                              Specialist         118877
             Sales            Assistant           77901
Phoenix      Sales            Manager            100459
San Antonio  IT               Manager             58347
             Marketing        Assistant           52192
                              Manager             54189
             Sales            Coordinator         85945
                              Manager             63155
San Diego    Customer Service Analyst             44944
                              Assistant          102214
             Marketing        Analyst            105629
                              Assistant           41846
             Operations       Manager             64931

In [4]:
import pandas as pd

d1 = pd.read_csv("orders.csv")
d2 = pd.read_csv("order_details.csv")
print(d1)
print(d2)

       order_id        date      time
0             1  2015-01-01  11:38:36
1             2  2015-01-01  11:57:40
2             3  2015-01-01  12:12:28
3             4  2015-01-01  12:16:31
4             5  2015-01-01  12:21:30
...         ...         ...       ...
21345     21346  2015-12-31  20:51:07
21346     21347  2015-12-31  21:14:37
21347     21348  2015-12-31  21:23:10
21348     21349  2015-12-31  22:09:54
21349     21350  2015-12-31  23:02:05

[21350 rows x 3 columns]
       order_details_id  order_id       pizza_id  quantity
0                     1         1     hawaiian_m         1
1                     2         2  classic_dlx_m         1
2                     3         2  five_cheese_l         1
3                     4         2    ital_supr_l         1
4                     5         2     mexicana_m         1
...                 ...       ...            ...       ...
48615             48616     21348  ckn_alfredo_m         1
48616             48617     21348  four_cheese_l         1
48617             48618     21348   napolitana_s         1
48618             48619     21349     mexicana_l         1
48619             48620     21350      bbq_ckn_s         1

[48620 rows x 4 columns]

In [5]:
print(pd.merge(d1,d2,on = "order_id"))

       order_id        date      time  order_details_id       pizza_id  \
0             1  2015-01-01  11:38:36                 1     hawaiian_m
1             2  2015-01-01  11:57:40                 2  classic_dlx_m
2             2  2015-01-01  11:57:40                 3  five_cheese_l
3             2  2015-01-01  11:57:40                 4    ital_supr_l
4             2  2015-01-01  11:57:40                 5     mexicana_m
...         ...         ...       ...               ...            ...
48615     21348  2015-12-31  21:23:10             48616  ckn_alfredo_m
48616     21348  2015-12-31  21:23:10             48617  four_cheese_l
48617     21348  2015-12-31  21:23:10             48618   napolitana_s
48618     21349  2015-12-31  22:09:54             48619     mexicana_l
48619     21350  2015-12-31  23:02:05             48620      bbq_ckn_s

       quantity
0             1
1             1
2             1
3             1
4             1
...         ...
48615         1
48616         1
48617         1
48618         1
48619         1

[48620 rows x 6 columns]

In [16]:
data1 = {"Emp Id":["Ε01", "Ε02", "Ε03", "Ε04", "E05", "E06"],
       "Names":["Ram", "Shyam", "Rahul", "Vishal", "Ravi","Aakash"],
       "Age": [34,56,23,44,32,40] }

data2 = {"Emp Id":["Ε01", "Ε02", "Ε03", "E04", "E05", "E06"], 
         "Salary": [45000, 56000, 34000, 30000, 60000,50000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print(df2)

  Emp Id   Names  Age
0    Ε01     Ram   34
1    Ε02   Shyam   56
2    Ε03   Rahul   23
3    Ε04  Vishal   44
4    E05    Ravi   32
5    E06  Aakash   40
  Emp Id  Salary
0    Ε01   45000
1    Ε02   56000
2    Ε03   34000
3    E04   30000
4    E05   60000
5    E06   50000

In [20]:
print(pd.merge(df1,df2,on = "Emp Id" ,how = "left"))

  Emp Id   Names  Age   Salary
0    Ε01     Ram   34  45000.0
1    Ε02   Shyam   56  56000.0
2    Ε03   Rahul   23  34000.0
3    Ε04  Vishal   44      NaN
4    E05    Ravi   32  60000.0
5    E06  Aakash   40  50000.0

In [21]:
data1 = {"Emp Id":["Ε01", "Ε02", "Ε03", "Ε04", "E05", "E06"],
       "Names":["Ram", "Shyam", "Rahul", "Vishal", "Ravi","Aakash"],
       "Age": [34,56,23,44,32,40] }

data2 = {"Emp Id":["Ε07", "Ε08", "Ε09", "Ε10", "E11", "E12"],
       "Names":["Ram", "Shyam", "Rahul", "Vishal", "Ravi","Aakash"],
       "Age": [34,56,23,44,32,40] }


df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print(df2)

  Emp Id   Names  Age
0    Ε01     Ram   34
1    Ε02   Shyam   56
2    Ε03   Rahul   23
3    Ε04  Vishal   44
4    E05    Ravi   32
5    E06  Aakash   40
  Emp Id   Names  Age
0    Ε07     Ram   34
1    Ε08   Shyam   56
2    Ε09   Rahul   23
3    Ε10  Vishal   44
4    E11    Ravi   32
5    E12  Aakash   40

In [ ]:
# concatination.....

In [22]:
print(pd.concat([df1,df2]))

  Emp Id   Names  Age
0    Ε01     Ram   34
1    Ε02   Shyam   56
2    Ε03   Rahul   23
3    Ε04  Vishal   44
4    E05    Ravi   32
5    E06  Aakash   40
0    Ε07     Ram   34
1    Ε08   Shyam   56
2    Ε09   Rahul   23
3    Ε10  Vishal   44
4    E11    Ravi   32
5    E12  Aakash   40

In [ ]:
# comparision of data.....

In [25]:
df2=df1.copy()
print(df2)

  Emp Id   Names  Age
0    Ε01     Ram   34
1    Ε02   Shyam   56
2    Ε03   Rahul   23
3    Ε04  Vishal   44
4    E05    Ravi   32
5    E06  Aakash   40

In [26]:
df2.loc[0,"Age"] = 35
df2.loc[1,"Age"] = 57
df2.loc[2,"Age"] = 24
df2.loc[3,"Age"] = 45
df2.loc[4,"Age"] = 33
df2.loc[5,"Age"] = 41
print(df2)

  Emp Id   Names  Age
0    Ε01     Ram   35
1    Ε02   Shyam   57
2    Ε03   Rahul   24
3    Ε04  Vishal   45
4    E05    Ravi   33
5    E06  Aakash   41

In [27]:
# to view changed data ...what change happened..
print (df1.compare(df2))

   Age
  self other
0   34    35
1   56    57
2   23    24
3   44    45
4   32    33
5   40    41

In [28]:
print(df1.compare(df2 , keep_shape=False))

   Age
  self other
0   34    35
1   56    57
2   23    24
3   44    45
4   32    33
5   40    41

In [ ]:
# Pivoting and Melthing DataFrames

In [42]:
import pandas as pd

dict ={"keys":["k1","k2","k1","k2"],
        "Names":["Ram", "Shyam", "Sita","Radha"],
        "Houses":["red", "blue", "green", "red"],
        "Grades":["3rd", "8th", "9th", "8th"] }
df = pd.DataFrame(dict)
print (df)

  keys  Names Houses Grades
0   k1    Ram    red    3rd
1   k2  Shyam   blue    8th
2   k1   Sita  green    9th
3   k2  Radha    red    8th

In [43]:
print (df.pivot(index = "keys",columns = "Names",values = ["Houses","Grades"]))

      Houses                   Grades
Names  Radha  Ram Shyam   Sita  Radha  Ram Shyam Sita
keys
k1       NaN  red   NaN  green    NaN  3rd   NaN  9th
k2       red  NaN  blue    NaN    8th  NaN   8th  NaN

In [44]:
import pandas as pd

dict ={ "Names":["Ram", "Shyam", "Sita","Radha"],
        "Houses":["red", "blue", "green", "red"],
        "Grades":["3rd", "8th", "9th", "8th"] }
df = pd.DataFrame(dict)
print (df)

   Names Houses Grades
0    Ram    red    3rd
1  Shyam   blue    8th
2   Sita  green    9th
3  Radha    red    8th

In [48]:
print(pd.melt(df , id_vars = ["Names"] , value_vars = ["Houses","Grades"] , var_name = "Houses&Grades" , value_name = "valuename"))

   Names Houses&Grades valuename
0    Ram        Houses       red
1  Shyam        Houses      blue
2   Sita        Houses     green
3  Radha        Houses       red
4    Ram        Grades       3rd
5  Shyam        Grades       8th
6   Sita        Grades       9th
7  Radha        Grades       8th